## production: create_metrics_lambda
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.create_metrics_put_s3 will be created
  + resource "aws_iam_policy" "create_metrics_put_s3" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CovidAlertCreateMetricsPutS3Object"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObjectAcl",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::error-samples-tdvfd-production/*",
                          + "arn:aws:s3:::error-samples-tdvfd-production",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.createmetrics_s3_put will be created
  + resource "aws_iam_role_policy_attachment" "createmetrics_s3_put" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "create_lambda_role"
    }

  # aws_lambda_function.create_metrics will be updated in-place
  ~ resource "aws_lambda_function" "create_metrics" {
        id                             = "create_metrics"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "BUCKET_NAME"     = "error-samples-tdvfd-production"
                # (2 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_security_group.create_metrics_sg will be updated in-place
  ~ resource "aws_security_group" "create_metrics_sg" {
      ~ egress                 = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = [
                  + "pl-4ea54027",
                  + "pl-7da54014",
                ]
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = [
                  - "pl-4ea54027",
                ]
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ]
        id                     = "sg-042c6fc04d1da08c6"
        name                   = "create_metrics_sg"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>